app/views/user_faqs/_form.html.erb

    <%= f.label :paper %><br />
    <%= collection_select :user_faq, :paper_id, Paper.all, :id, :title%>
---
SELECT "papers".* FROM "papers"