app/views/faqs/index.html.erb

    <td><%= faq.answer %></td>
    <td><%= raw faq.tag_list.map { |t| link_to t, tag_path(t) }.join(', ')  %></td>
---
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN faqs ON faqs.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Faq' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT faqs.id FROM "faqs" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id