app/views/search_pages/index.html.erb

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('potato'))
---
    <td><%= search_page.SPARK_publication_date %></td>
    <td><%= raw search_page.tag_list.map { |t| link_to t, tag_path(t) }.join(', ')  %></td>