app/views/papers/index.html.erb

    <td><%= paper.description %></td>
    <td id="tag"><%= raw paper.tag_list.map { |t| link_to t, tag_path(t) }.join(', ')  %></td>
---
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN papers ON papers.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Paper' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT papers.id FROM "papers" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id