app/views/papers/show.html.erb

  <b>User FAQ's:</b>
  <% @paper.user_faqs.each do |faq| %>
---
SELECT "faqs".* FROM "faqs" WHERE "faqs"."paper_id" = 1