app/views/papers/show.html.erb

  <b>User FAQ's:</b>
  <% @paper.user_faqs.each do |faq| %>
---
SELECT "user_faqs".* FROM "user_faqs" WHERE "user_faqs"."paper_id" = 1