app/controllers/faqs_controller.rb

SELECT "faqs".* FROM "faqs" WHERE (paper_id = '1')
SELECT "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def index
    @faqs = Faq.where("paper_id = ?", params[:paper_id])
    @paper = Paper.find(params[:paper_id])

SELECT "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @faq = Faq.new
    @faq.paper_id = params[:paper_id]
    @paper = Paper.find(params[:paper_id])

SELECT "faqs".* FROM "faqs" WHERE "faqs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @faq = Faq.find(params[:id])

INSERT INTO "faqs" ("answer", "created_at", "paper_id", "question", "type1", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["answer", nil], ["created_at", Mon, 08 Dec 2014 01:18:55 UTC +00:00], ["paper_id", 1], ["question", "New question"], ["type1", nil], ["updated_at", Mon, 08 Dec 2014 01:18:55 UTC +00:00]]
SELECT "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
    @faq = Faq.new(params[:faq])
    @faq.paper_id = params[:paper_id]
    #
    # @faq.type1 = 0
    # @faq.type1 = 1 if author_signed_in?
# <<<<<<< HEAD
#     @paper = Paper.find(params[:paper_id])
#     @faq.paper_id = params[:paper_id]
#     @faq.save
#     respond_with(@paper.faq)
# =======

    # Pierre's version
    @faq.save
    @paper = Paper.find(@faq.paper_id)

SELECT "faqs".* FROM "faqs" WHERE "faqs"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "faqs" SET "question" = 'New question123', "updated_at" = '2014-12-08 02:18:07.090766' WHERE "faqs"."id" = 1
---
  def update
    @paper = Paper.find(params[:paper_id])
    @faq = Faq.find(params[:id])
    @faq.update_attributes(params[:faq])

DELETE FROM "faqs" WHERE "faqs"."id" = ?  [["id", 1]]
---
  def destroy
    @faq.destroy

SELECT "faqs".* FROM "faqs" WHERE "faqs"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_faq
      @faq = Faq.find(params[:id])