app/controllers/papers_controller.rb

SELECT "papers".* FROM "papers" WHERE (description LIKE '%hi%' OR author LIKE '%hi%' OR title LIKE '%hi%')
---
  def index


    @papers = Paper.where("author_id = ?", current_author.id) if (author_signed_in? && params[:search].blank?)

SELECT "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @paper = Paper.find(params[:id])

SELECT "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT 1  [["id", "6"]]
---
  def edit
    @paper = Paper.find(params[:id])

INSERT INTO "papers" ("author", "author_id", "created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", nil], ["author_id", 6], ["created_at", Mon, 17 Nov 2014 22:55:56 UTC +00:00], ["description", "Typical"], ["title", "Mutemath"], ["updated_at", Mon, 17 Nov 2014 22:55:56 UTC +00:00]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 6 LIMIT 1
---
  def create
    @paper = Paper.new(params[:paper])
    @paper.author_id = current_author.id
    @document = @paper.documents.new(params[:document])
    respond_to do |format|
      if @paper.save
        File.open("public/system/uploads/#{@document.id}/#{@document.asset_file_name}", "rb") do |io|
          reader = PDF::Reader.new(io)
          if reader.page_count > 10
            @paper.destroy
            @papers = Paper.where("author_id = ?", current_author.id)

SELECT "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "papers" SET "updated_at" = '2014-11-21 00:02:21.987743' WHERE "papers"."id" = 6
---
  def update
    @paper = Paper.find(params[:id])

    respond_to do |format|
      if @paper.update_attributes(params[:paper])

SELECT "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "papers" WHERE "papers"."id" = ?  [["id", 3]]
---
  def destroy
    @paper = Paper.find(params[:id])
    @paper.destroy