app/controllers/papers_controller.rb

SELECT "papers".* FROM "papers" WHERE ( title LIKE '%deccan%')
---
  def index


    @papers = Paper.where("author_id = ?", current_author.id) if (author_signed_in? && params[:search].blank?)

INSERT INTO "documents" ("asset_content_type", "asset_file_name", "asset_file_size", "asset_updated_at", "created_at", "paper_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "papers" ("attach_content_type", "attach_file_name", "attach_file_size", "attach_updated_at", "author_id", "created_at", "description", "document_content_type", "document_file_name", "document_file_size", "document_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @paper = Paper.new(params[:paper])
    @paper.author_id = current_author.id
    @document = @paper.documents.new(params[:document])
    respond_to do |format|
      if @paper.save

UPDATE "papers" SET "title" = 'Experiment123', "updated_at" = '2014-12-08 01:59:11.758530' WHERE "papers"."id" = 1
---
  def update
    @paper = Paper.find(params[:id])

    respond_to do |format|
      if @paper.update_attributes(params[:paper])