app/controllers/search_pages_controller.rb

SELECT "search_pages".* FROM "search_pages" WHERE (title LIKE '%ruby%' OR author LIKE '%ruby%' OR publication_date LIKE '%ruby%' OR SPARK_publication_date LIKE '%ruby%')
---
  def index
    @search_pages =SearchPage.search(params[:search])

SELECT "search_pages".* FROM "search_pages" WHERE "search_pages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @search_page = SearchPage.find(params[:id])

SELECT "search_pages".* FROM "search_pages" WHERE "search_pages"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @search_page = SearchPage.find(params[:id])

INSERT INTO "search_pages" ("SPARK_publication_date", "author", "created_at", "publication_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @search_page = SearchPage.new(params[:search_page])

    respond_to do |format|
      if @search_page.save