app/controllers/user_faqs_controller.rb

SELECT "user_faqs".* FROM "user_faqs"
---
  def index
    @user_faqs = UserFaq.all

INSERT INTO "user_faqs" ("Question", "created_at", "paper_id", "updated_at") VALUES (?, ?, ?, ?)  [["Question", "question1"], ["created_at", Tue, 11 Nov 2014 04:46:59 UTC +00:00], ["paper_id", 2], ["updated_at", Tue, 11 Nov 2014 04:46:59 UTC +00:00]]
---
  def create
    @user_faq = UserFaq.new(params[:user_faq])
    @user_faq.save

SELECT "user_faqs".* FROM "user_faqs" WHERE "user_faqs"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_user_faq
      @user_faq = UserFaq.find(params[:id])